##
- 1.df.isna().sum ------>to check NaN value counts
- 2.df.isnull().sum()

In [4]:
import pandas as pd
import os
os.getcwd()
change="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(change)
df=''
for file in os.listdir():
    if file.endswith(".csv") and "nan" in file:
        df=pd.read_csv("sample_with_nan_values.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 50 non-null     int64
 1   Name               43 non-null     object
 2   Age                40 non-null     float64
 3   Department         41 non-null     object
 4   Salary             44 non-null     float64
 5   Joining_Date       42 non-null     object
 6   Performance_Score  42 non-null     float64
dtypes: float64(3), int64(1), object(3)
memory usage: 2.9+ KB

In [6]:
df.describe()

             ID        Age        Salary  Performance_Score
count  50.00000  40.000000     44.000000          42.000000
mean   25.50000  29.350000  54695.750000           2.642857
std    14.57738   6.646958  14400.798297           1.411130
min     1.00000  18.000000  30206.000000           1.000000
25%    13.25000  24.000000  42966.750000           1.000000
50%    25.50000  29.000000  53509.000000           3.000000
75%    37.75000  36.000000  66081.500000           4.000000
max    50.00000  39.000000  78702.000000           5.000000

In [7]:
df.shape

(50, 7)

In [8]:
df.size

350

In [9]:
df.index

RangeIndex(start=0, stop=50, step=1)

In [10]:
df.columns

Index(['ID', 'Name', 'Age', 'Department', 'Salary', 'Joining_Date',
       'Performance_Score'],
      dtype='object')

In [11]:
df["ID"].dtype

dtype('int64')

In [12]:
df["ID"].astype("int8")

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
20    21
21    22
22    23
23    24
24    25
25    26
26    27
27    28
28    29
29    30
30    31
31    32
32    33
33    34
34    35
35    36
36    37
37    38
38    39
39    40
40    41
41    42
42    43
43    44
44    45
45    46
46    47
47    48
48    49
49    50
Name: ID, dtype: int8

In [13]:
df["ID"].array

<NumpyExtensionArray>
[ np.int64(1),  np.int64(2),  np.int64(3),  np.int64(4),  np.int64(5),
  np.int64(6),  np.int64(7),  np.int64(8),  np.int64(9), np.int64(10),
 np.int64(11), np.int64(12), np.int64(13), np.int64(14), np.int64(15),
 np.int64(16), np.int64(17), np.int64(18), np.int64(19), np.int64(20),
 np.int64(21), np.int64(22), np.int64(23), np.int64(24), np.int64(25),
 np.int64(26), np.int64(27), np.int64(28), np.int64(29), np.int64(30),
 np.int64(31), np.int64(32), np.int64(33), np.int64(34), np.int64(35),
 np.int64(36), np.int64(37), np.int64(38), np.int64(39), np.int64(40),
 np.int64(41), np.int64(42), np.int64(43), np.int64(44), np.int64(45),
 np.int64(46), np.int64(47), np.int64(48), np.int64(49), np.int64(50)]
Length: 50, dtype: int64

In [14]:
df.head()

   ID    Name   Age Department   Salary Joining_Date  Performance_Score
0   1  Name_1  24.0         IT  32695.0   2022-06-18                1.0
1   2  Name_2  37.0  Marketing  78190.0   2022-01-03                4.0
2   3  Name_3  32.0         HR  35258.0   2021-04-29                5.0
3   4  Name_4  28.0  Marketing  52002.0   2021-02-10                1.0
4   5  Name_5   NaN         IT  69504.0   2020-08-18                3.0

In [16]:
df1=df["Department"]=="IT"
df[df1]

    ID     Name   Age Department   Salary Joining_Date  Performance_Score
0    1   Name_1  24.0         IT  32695.0   2022-06-18                1.0
4    5   Name_5   NaN         IT  69504.0   2020-08-18                3.0
5    6   Name_6  25.0         IT  63159.0          NaN                NaN
7    8   Name_8  24.0         IT      NaN   2021-10-16                1.0
9   10  Name_10   NaN         IT  68660.0   2021-06-24                5.0
18  19  Name_19  38.0         IT  78033.0   2020-03-26                1.0
20  21      NaN  19.0         IT  65222.0   2021-07-31                1.0
21  22  Name_22  29.0         IT  41837.0   2021-11-12                2.0
24  25  Name_25   NaN         IT  60818.0   2021-07-27                NaN
25  26  Name_26  38.0         IT  49115.0   2022-08-10                2.0
27  28      NaN  29.0         IT  54538.0   2022-03-06                1.0
28  29  Name_29  39.0         IT  72530.0   2020-01-28                5.0
34  35      NaN   NaN         IT  43773.0   2022-08-15                2.0
36  37  Name_37  32.0         IT  47412.0   2020-11-26                NaN

In [17]:
df2=df["Salary"]>50000
df[df2]

    ID     Name   Age Department   Salary Joining_Date  Performance_Score
1    2   Name_2  37.0  Marketing  78190.0   2022-01-03                4.0
3    4   Name_4  28.0  Marketing  52002.0   2021-02-10                1.0
4    5   Name_5   NaN         IT  69504.0   2020-08-18                3.0
5    6   Name_6  25.0         IT  63159.0          NaN                NaN
9   10  Name_10   NaN         IT  68660.0   2021-06-24                5.0
11  12  Name_12  28.0  Marketing  56854.0          NaN                3.0
12  13  Name_13  38.0  Marketing  68952.0   2021-06-08                2.0
13  14      NaN  21.0  Marketing  52662.0   2020-06-08                4.0
16  17  Name_17  20.0         HR  60535.0   2020-08-30                1.0
18  19  Name_19  38.0         IT  78033.0   2020-03-26                1.0
19  20  Name_20   NaN  Marketing  53599.0   2022-03-06                NaN
20  21      NaN  19.0         IT  65222.0   2021-07-31                1.0
24  25  Name_25   NaN         IT  60818.0   2021-07-27                NaN
27  28      NaN  29.0         IT  54538.0   2022-03-06                1.0
28  29  Name_29  39.0         IT  72530.0   2020-01-28                5.0
30  31  Name_31  29.0  Marketing  62482.0   2021-09-11                1.0
32  33  Name_33  27.0        NaN  77716.0   2020-12-05                1.0
35  36  Name_36  32.0        NaN  57266.0          NaN                4.0
37  38  Name_38  36.0         HR  63270.0   2021-10-01                5.0
40  41  Name_41  37.0  Marketing  75453.0   2021-04-17                3.0
41  42      NaN  20.0        NaN  55446.0          NaN                NaN
43  44  Name_44  36.0        NaN  51518.0   2020-07-08                5.0
44  45  Name_45   NaN        NaN  52361.0   2020-08-12                4.0
45  46  Name_46  24.0         HR  53419.0   2021-01-19                2.0
46  47  Name_47  38.0         HR  78702.0   2021-01-11                NaN
48  49      NaN  24.0         HR  71523.0   2020-10-09                3.0
49  50  Name_50   NaN  Marketing  75151.0   2022-08-15                3.0

In [25]:
df3=df[(df["Age"]>30) & (df["Salary"]>60000)]
df3

    ID     Name   Age Department   Salary Joining_Date Performance_Score
1    2   Name_2  37.0  Marketing  78190.0   2022-01-03            Rating
12  13  Name_13  38.0  Marketing  68952.0   2021-06-08            Rating
18  19  Name_19  38.0         IT  78033.0   2020-03-26            Rating
28  29  Name_29  39.0         IT  72530.0   2020-01-28            Rating
37  38  Name_38  36.0         HR  63270.0   2021-10-01            Rating
40  41  Name_41  37.0  Marketing  75453.0   2021-04-17            Rating
46  47  Name_47  38.0         HR  78702.0   2021-01-11            Rating

In [27]:
df.head()

   ID    Name   Age Department   Salary Joining_Date Performance_Score
0   1  Name_1  24.0         IT  32695.0   2022-06-18            Rating
1   2  Name_2  37.0  Marketing  78190.0   2022-01-03            Rating
2   3  Name_3  32.0         HR  35258.0   2021-04-29            Rating
3   4  Name_4  28.0  Marketing  52002.0   2021-02-10            Rating
4   5  Name_5   NaN         IT  69504.0   2020-08-18            Rating

In [31]:
df4=df.sort_values("Salary")
df4.head()

    ID     Name   Age Department   Salary Joining_Date Performance_Score
42  43  Name_43  22.0         HR  30206.0   2020-08-18            Rating
0    1   Name_1  24.0         IT  32695.0   2022-06-18            Rating
10  11  Name_11  28.0  Marketing  33561.0   2020-02-05            Rating
29  30  Name_30   NaN  Marketing  35056.0          NaN            Rating
2    3   Name_3  32.0         HR  35258.0   2021-04-29            Rating

In [32]:
df5=df.sort_values(by=["Age","Salary"],ascending=[True,False])
df5.head()

    ID     Name   Age Department   Salary Joining_Date Performance_Score
26  27  Name_27  18.0  Marketing  40965.0   2021-10-07            Rating
20  21      NaN  19.0         IT  65222.0   2021-07-31            Rating
23  24  Name_24  19.0        NaN      NaN          NaN            Rating
16  17  Name_17  20.0         HR  60535.0   2020-08-30            Rating
41  42      NaN  20.0        NaN  55446.0          NaN            Rating

In [33]:
df6=df.rename(columns={"Performance_Score":"Rating","ID":"Identity"})
df6.head()

   Identity    Name   Age Department   Salary Joining_Date  Rating
0         1  Name_1  24.0         IT  32695.0   2022-06-18  Rating
1         2  Name_2  37.0  Marketing  78190.0   2022-01-03  Rating
2         3  Name_3  32.0         HR  35258.0   2021-04-29  Rating
3         4  Name_4  28.0  Marketing  52002.0   2021-02-10  Rating
4         5  Name_5   NaN         IT  69504.0   2020-08-18  Rating

In [34]:
df.head()

   ID    Name   Age Department   Salary Joining_Date Performance_Score
0   1  Name_1  24.0         IT  32695.0   2022-06-18            Rating
1   2  Name_2  37.0  Marketing  78190.0   2022-01-03            Rating
2   3  Name_3  32.0         HR  35258.0   2021-04-29            Rating
3   4  Name_4  28.0  Marketing  52002.0   2021-02-10            Rating
4   5  Name_5   NaN         IT  69504.0   2020-08-18            Rating

In [37]:
df7=df.groupby("Department")["Salary"].sum().reset_index()
df7

  Department    Salary
0    Finance       0.0
1         HR  436899.0
2         IT  747296.0
3  Marketing  808943.0

In [39]:
df8=df["Salary"].rolling(window=3).mean().reset_index()
df8.head()

   index        Salary
0      0           NaN
1      1           NaN
2      2  48714.333333
3      3  55150.000000
4      4  52254.666667

In [40]:
df9=df.groupby("Department")["Salary"].agg(["sum","mean","max"]).reset_index()
df9

  Department       sum          mean      max
0    Finance       0.0           NaN      NaN
1         HR  436899.0  54612.375000  78702.0
2         IT  747296.0  57484.307692  78033.0
3  Marketing  808943.0  53929.533333  78190.0

In [42]:
df.dropna().head()

    ID     Name   Age Department   Salary Joining_Date Performance_Score
0    1   Name_1  24.0         IT  32695.0   2022-06-18            Rating
1    2   Name_2  37.0  Marketing  78190.0   2022-01-03            Rating
2    3   Name_3  32.0         HR  35258.0   2021-04-29            Rating
3    4   Name_4  28.0  Marketing  52002.0   2021-02-10            Rating
10  11  Name_11  28.0  Marketing  33561.0   2020-02-05            Rating

In [45]:
df.fillna("Uknown").head(10)

   ID     Name     Age Department   Salary Joining_Date Performance_Score
0   1   Name_1    24.0         IT  32695.0   2022-06-18            Rating
1   2   Name_2    37.0  Marketing  78190.0   2022-01-03            Rating
2   3   Name_3    32.0         HR  35258.0   2021-04-29            Rating
3   4   Name_4    28.0  Marketing  52002.0   2021-02-10            Rating
4   5   Name_5  Uknown         IT  69504.0   2020-08-18            Rating
5   6   Name_6    25.0         IT  63159.0       Uknown            Rating
6   7   Uknown    38.0         HR  43986.0   2022-01-18            Rating
7   8   Name_8    24.0         IT   Uknown   2021-10-16            Rating
8   9   Name_9    36.0     Uknown  42666.0   2020-06-19            Rating
9  10  Name_10  Uknown         IT  68660.0   2021-06-24            Rating

Find the number of missing values in each column.

In [50]:
df10=df.value_counts(["Name","Age"])
df10

Name     Age
Name_1   24.0    1
Name_11  28.0    1
Name_12  28.0    1
Name_13  38.0    1
Name_16  25.0    1
Name_17  20.0    1
Name_18  39.0    1
Name_19  38.0    1
Name_2   37.0    1
Name_22  29.0    1
Name_23  23.0    1
Name_24  19.0    1
Name_26  38.0    1
Name_27  18.0    1
Name_29  39.0    1
Name_3   32.0    1
Name_31  29.0    1
Name_32  34.0    1
Name_33  27.0    1
Name_34  33.0    1
Name_36  32.0    1
Name_37  32.0    1
Name_38  36.0    1
Name_39  29.0    1
Name_4   28.0    1
Name_41  37.0    1
Name_43  22.0    1
Name_44  36.0    1
Name_46  24.0    1
Name_47  38.0    1
Name_48  26.0    1
Name_6   25.0    1
Name_8   24.0    1
Name_9   36.0    1
Name: count, dtype: int64

In [60]:
df11=df.value_counts(dropna=False).reset_index()
df11

,ID,Name,Age,Department,Salary,Joining_Date,Performance_Score,count
0,1,Name_1,24.0,IT,32695.0,2022-06-18,Rating,1
1,2,Name_2,37.0,Marketing,78190.0,2022-01-03,Rating,1
2,3,Name_3,32.0,HR,35258.0,2021-04-29,Rating,1
3,4,Name_4,28.0,Marketing,52002.0,2021-02-10,Rating,1
4,5,Name_5,NaN,IT,69504.0,2020-08-18,Rating,1
5,6,Name_6,25.0,IT,63159.0,NaN,Rating,1
6,7,NaN,38.0,HR,43986.0,2022-01-18,Rating,1
7,8,Name_8,24.0,IT,NaN,2021-10-16,Rating,1
8,9,Name_9,36.0,NaN,42666.0,2020-06-19,Rating,1
9,10,Name_10,NaN,IT,68660.0,2021-06-24,Rating,1
10,11,Name_11,28.0,Marketing,33561.0,2020-02-05,Rating,1
11,12,Name_12,28.0,Marketing,56854.0,NaN,Rating,1
12,13,Name_13,38.0,Marketing,68952.0,2021-06-08,Rating,1
13,14,NaN,21.0,Marketing,52662.0,2020-06-08,Rating,1
14,15,Name_15,NaN,NaN,38392.0,2022-04-18,Rating,1
15,16,Name_16,25.0,Finance,NaN,2021-11-29,Rating,1
16,17,Name_17,20.0,HR,60535.0,2020-08-30,Rating,1
17,18,Name_18,39.0,Marketing,43067.0,NaN,Rating,1
18,19,Name_19,38.0,IT,78033.0,2020-03-26,Rating,1
19,20,Name_20,NaN,Marketing,53599.0,2022-03-06,Rating,1
20,21,NaN,19.0,IT,65222.0,2021-07-31,Rating,1
21,22,Name_22,29.0,IT,41837.0,2021-11-12,Rating,1
22,23,Name_23,23.0,Marketing,44039.0,2021-07-10,Rating,1
23,24,Name_24,19.0,NaN,NaN,NaN,Rating,1
24,25,Name_25,NaN,IT,60818.0,2021-07-27,Rating,1
25,26,Name_26,38.0,IT,49115.0,2022-08-10,Rating,1
26,27,Name_27,18.0,Marketing,40965.0,2021-10-07,Rating,1
27,28,NaN,29.0,IT,54538.0,2022-03-06,Rating,1
28,29,Name_29,39.0,IT,72530.0,2020-01-28,Rating,1
29,30,Name_30,NaN,Marketing,35056.0,NaN,Rating,1
30,31,Name_31,29.0,Marketing,62482.0,2021-09-11,Rating,1
31,32,Name_32,34.0,HR,NaN,2021-07-09,Rating,1
32,33,Name_33,27.0,NaN,77716.0,2020-12-05,Rating,1
33,34,Name_34,33.0,NaN,38110.0,2022-03-08,Rating,1
34,35,NaN,NaN,IT,43773.0,2022-08-15,Rating,1
35,36,Name_36,32.0,NaN,57266.0,NaN,Rating,1
36,37,Name_37,32.0,IT,47412.0,2020-11-26,Rating,1
37,38,Name_38,36.0,HR,63270.0,2021-10-01,Rating,1
38,39,Name_39,29.0,Marketing,36910.0,2021-05-20,Rating,1
39,40,Name_40,NaN,Marketing,NaN,2020-12-13,Rating,1
40,41,Name_41,37.0,Marketing,75453.0,2021-04-17,Rating,1
41,42,NaN,20.0,NaN,55446.0,NaN,Rating,1
42,43,Name_43,22.0,HR,30206.0,2020-08-18,Rating,1
43,44,Name_44,36.0,NaN,51518.0,2020-07-08,Rating,1
44,45,Name_45,NaN,NaN,52361.0,2020-08-12,Rating,1
45,46,Name_46,24.0,HR,53419.0,2021-01-19,Rating,1
46,47,Name_47,38.0,HR,78702.0,2021-01-11,Rating,1
47,48,Name_48,26.0,HR,NaN,NaN,Rating,1
48,49,NaN,24.0,HR,71523.0,2020-10-09,Rating,1
49,50,Name_50,NaN,Marketing,75151.0,2022-08-15,Rating,1

In [71]:
df13=df.isna().sum()

In [72]:
df13

ID                    0
Name                  7
Age                  10
Department            9
Salary                6
Joining_Date          8
Performance_Score     0
dtype: int64

Fill missing Age values with the mean age.

In [75]:
df14=df["Age"].fillna(df["Age"].agg("mean"))
df14

0     24.00
1     37.00
2     32.00
3     28.00
4     29.35
5     25.00
6     38.00
7     24.00
8     36.00
9     29.35
10    28.00
11    28.00
12    38.00
13    21.00
14    29.35
15    25.00
16    20.00
17    39.00
18    38.00
19    29.35
20    19.00
21    29.00
22    23.00
23    19.00
24    29.35
25    38.00
26    18.00
27    29.00
28    39.00
29    29.35
30    29.00
31    34.00
32    27.00
33    33.00
34    29.35
35    32.00
36    32.00
37    36.00
38    29.00
39    29.35
40    37.00
41    20.00
42    22.00
43    36.00
44    29.35
45    24.00
46    38.00
47    26.00
48    24.00
49    29.35
Name: Age, dtype: float64

Drop rows where Salary is missing.

In [78]:
df["Salary"].dropna()

0     32695.0
1     78190.0
2     35258.0
3     52002.0
4     69504.0
5     63159.0
6     43986.0
8     42666.0
9     68660.0
10    33561.0
11    56854.0
12    68952.0
13    52662.0
14    38392.0
16    60535.0
17    43067.0
18    78033.0
19    53599.0
20    65222.0
21    41837.0
22    44039.0
24    60818.0
25    49115.0
26    40965.0
27    54538.0
28    72530.0
29    35056.0
30    62482.0
32    77716.0
33    38110.0
34    43773.0
35    57266.0
36    47412.0
37    63270.0
38    36910.0
40    75453.0
41    55446.0
42    30206.0
43    51518.0
44    52361.0
45    53419.0
46    78702.0
48    71523.0
49    75151.0
Name: Salary, dtype: float64

Find the average Salary by Department.

In [79]:
df.head()

   ID    Name   Age Department   Salary Joining_Date Performance_Score
0   1  Name_1  24.0         IT  32695.0   2022-06-18            Rating
1   2  Name_2  37.0  Marketing  78190.0   2022-01-03            Rating
2   3  Name_3  32.0         HR  35258.0   2021-04-29            Rating
3   4  Name_4  28.0  Marketing  52002.0   2021-02-10            Rating
4   5  Name_5   NaN         IT  69504.0   2020-08-18            Rating

In [80]:
df16=df.groupby("Department")["Salary"].mean()
df16

Department
Finance               NaN
HR           54612.375000
IT           57484.307692
Marketing    53929.533333
Name: Salary, dtype: float64

Sort the DataFrame by Joining_Date.

In [86]:
df17=df.sort_values("Joining_Date")
df17.head()

    ID     Name   Age Department   Salary Joining_Date Performance_Score
28  29  Name_29  39.0         IT  72530.0   2020-01-28            Rating
10  11  Name_11  28.0  Marketing  33561.0   2020-02-05            Rating
18  19  Name_19  38.0         IT  78033.0   2020-03-26            Rating
13  14      NaN  21.0  Marketing  52662.0   2020-06-08            Rating
8    9   Name_9  36.0        NaN  42666.0   2020-06-19            Rating

Replace missing Performance_Score with the median score.

In [88]:
df18=df["Performance_Score"].fillna("median_score")
df18.head()

0    Rating
1    Rating
2    Rating
3    Rating
4    Rating
Name: Performance_Score, dtype: object

Count the number of employees in each Department.

In [89]:
df19=df.value_counts("Department")
df19

Department
Marketing    16
IT           14
HR           10
Finance       1
Name: count, dtype: int64

Find employees who joined after 2022-01-01.

In [91]:
df20=df["Joining_Date"]>"2022-01-01"
df[df20]

    ID     Name   Age Department   Salary Joining_Date Performance_Score
0    1   Name_1  24.0         IT  32695.0   2022-06-18            Rating
1    2   Name_2  37.0  Marketing  78190.0   2022-01-03            Rating
6    7      NaN  38.0         HR  43986.0   2022-01-18            Rating
14  15  Name_15   NaN        NaN  38392.0   2022-04-18            Rating
19  20  Name_20   NaN  Marketing  53599.0   2022-03-06            Rating
25  26  Name_26  38.0         IT  49115.0   2022-08-10            Rating
27  28      NaN  29.0         IT  54538.0   2022-03-06            Rating
33  34  Name_34  33.0        NaN  38110.0   2022-03-08            Rating
34  35      NaN   NaN         IT  43773.0   2022-08-15            Rating
49  50  Name_50   NaN  Marketing  75151.0   2022-08-15            Rating

Calculate the maximum salary in the IT department.

In [96]:
df["IT_Salary"]=df["Department"]=="IT"
df.head()

,ID,Name,Age,Department,Salary,Joining_Date,Performance_Score,IT_Salary
0,1,Name_1,24.0,IT,32695.0,2022-06-18,Rating,True
1,2,Name_2,37.0,Marketing,78190.0,2022-01-03,Rating,False
2,3,Name_3,32.0,HR,35258.0,2021-04-29,Rating,False
3,4,Name_4,28.0,Marketing,52002.0,2021-02-10,Rating,False
4,5,Name_5,NaN,IT,69504.0,2020-08-18,Rating,True

In [97]:
df["IT_Salary"].max()

np.True_

In [99]:
def depart(department):
    it=[]
    if department=="IT":
        it.append(department)
    return max(it)

In [100]:
df22=df["Department"].apply(depart)

ValueError: max() iterable argument is empty

In [101]:
df23=df.loc[df["Department"]=="IT","Salary"].max()
df23

78033.0

Create a new column Bonus = Salary * 0.1

In [104]:
df["Bonus"]=df["Salary"]*0.1

In [105]:
df

,ID,Name,Age,Department,Salary,Joining_Date,Performance_Score,IT_Salary,Bonus
0,1,Name_1,24.0,IT,32695.0,2022-06-18,Rating,True,3269.5
1,2,Name_2,37.0,Marketing,78190.0,2022-01-03,Rating,False,7819.0
2,3,Name_3,32.0,HR,35258.0,2021-04-29,Rating,False,3525.8
3,4,Name_4,28.0,Marketing,52002.0,2021-02-10,Rating,False,5200.2
4,5,Name_5,NaN,IT,69504.0,2020-08-18,Rating,True,6950.4
5,6,Name_6,25.0,IT,63159.0,NaN,Rating,True,6315.9
6,7,NaN,38.0,HR,43986.0,2022-01-18,Rating,False,4398.6
7,8,Name_8,24.0,IT,NaN,2021-10-16,Rating,True,NaN
8,9,Name_9,36.0,NaN,42666.0,2020-06-19,Rating,False,4266.6
9,10,Name_10,NaN,IT,68660.0,2021-06-24,Rating,True,6866.0
10,11,Name_11,28.0,Marketing,33561.0,2020-02-05,Rating,False,3356.1
11,12,Name_12,28.0,Marketing,56854.0,NaN,Rating,False,5685.4
12,13,Name_13,38.0,Marketing,68952.0,2021-06-08,Rating,False,6895.2
13,14,NaN,21.0,Marketing,52662.0,2020-06-08,Rating,False,5266.2
14,15,Name_15,NaN,NaN,38392.0,2022-04-18,Rating,False,3839.2
15,16,Name_16,25.0,Finance,NaN,2021-11-29,Rating,False,NaN
16,17,Name_17,20.0,HR,60535.0,2020-08-30,Rating,False,6053.5
17,18,Name_18,39.0,Marketing,43067.0,NaN,Rating,False,4306.7
18,19,Name_19,38.0,IT,78033.0,2020-03-26,Rating,True,7803.3
19,20,Name_20,NaN,Marketing,53599.0,2022-03-06,Rating,False,5359.9
20,21,NaN,19.0,IT,65222.0,2021-07-31,Rating,True,6522.2
21,22,Name_22,29.0,IT,41837.0,2021-11-12,Rating,True,4183.7
22,23,Name_23,23.0,Marketing,44039.0,2021-07-10,Rating,False,4403.9
23,24,Name_24,19.0,NaN,NaN,NaN,Rating,False,NaN
24,25,Name_25,NaN,IT,60818.0,2021-07-27,Rating,True,6081.8
25,26,Name_26,38.0,IT,49115.0,2022-08-10,Rating,True,4911.5
26,27,Name_27,18.0,Marketing,40965.0,2021-10-07,Rating,False,4096.5
27,28,NaN,29.0,IT,54538.0,2022-03-06,Rating,True,5453.8
28,29,Name_29,39.0,IT,72530.0,2020-01-28,Rating,True,7253.0
29,30,Name_30,NaN,Marketing,35056.0,NaN,Rating,False,3505.6
30,31,Name_31,29.0,Marketing,62482.0,2021-09-11,Rating,False,6248.2
31,32,Name_32,34.0,HR,NaN,2021-07-09,Rating,False,NaN
32,33,Name_33,27.0,NaN,77716.0,2020-12-05,Rating,False,7771.6
33,34,Name_34,33.0,NaN,38110.0,2022-03-08,Rating,False,3811.0
34,35,NaN,NaN,IT,43773.0,2022-08-15,Rating,True,4377.3
35,36,Name_36,32.0,NaN,57266.0,NaN,Rating,False,5726.6
36,37,Name_37,32.0,IT,47412.0,2020-11-26,Rating,True,4741.2
37,38,Name_38,36.0,HR,63270.0,2021-10-01,Rating,False,6327.0
38,39,Name_39,29.0,Marketing,36910.0,2021-05-20,Rating,False,3691.0
39,40,Name_40,NaN,Marketing,NaN,2020-12-13,Rating,False,NaN
40,41,Name_41,37.0,Marketing,75453.0,2021-04-17,Rating,False,7545.3
41,42,NaN,20.0,NaN,55446.0,NaN,Rating,False,5544.6
42,43,Name_43,22.0,HR,30206.0,2020-08-18,Rating,False,3020.6
43,44,Name_44,36.0,NaN,51518.0,2020-07-08,Rating,False,5151.8
44,45,Name_45,NaN,NaN,52361.0,2020-08-12,Rating,False,5236.1
45,46,Name_46,24.0,HR,53419.0,2021-01-19,Rating,False,5341.9
46,47,Name_47,38.0,HR,78702.0,2021-01-11,Rating,False,7870.2
47,48,Name_48,26.0,HR,NaN,NaN,Rating,False,NaN
48,49,NaN,24.0,HR,71523.0,2020-10-09,Rating,False,7152.3
49,50,Name_50,NaN,Marketing,75151.0,2022-08-15,Rating,False,7515.1

In [106]:
os.getcwd()

'C:\\Users\\talib\\OneDrive\\Desktop'

In [110]:
df.to_json("sample_with_nan_values.json",orient="records",index=False)